In [1]:
import pandas as pd
import numpy as np
import os

In [11]:
import pandas as pd

data = {'ItemID': [1, 2, 3],
    'Tags': [['apple', 'fruit'], ['banana', 'fruit'], ['carrot', 'vegetable']]}

df = pd.DataFrame(data)

In [12]:
df

   ItemID                 Tags
0       1       [apple, fruit]
1       2      [banana, fruit]
2       3  [carrot, vegetable]

In [13]:
df.explode(column='Tags')

   ItemID       Tags
0       1      apple
0       1      fruit
1       2     banana
1       2      fruit
2       3     carrot
2       3  vegetable

In [14]:
df.Tags

0         [apple, fruit]
1        [banana, fruit]
2    [carrot, vegetable]
Name: Tags, dtype: object

In [55]:
data1 = {'ItemID': ['4-6', '9-11', '14-20'],
    'fruits': ['apple', 'banana','carrot'],
    'price': [80, 50 , 110]}

In [56]:
df1 = pd.DataFrame(data1)

In [57]:
df1

  ItemID  fruits  price
0    4-6   apple     80
1   9-11  banana     50
2  14-20  carrot    110

In [58]:
# g =[]
# for val in df1['ItemID']:
#     a,b = map(int, val.split('-'))
#     g.append(list(range(a, b + 1)))

In [59]:
df1['ItemID'] =[list(range(int(val.split('-')[0]), int(val.split('-')[1]) + 1)) for val in df1['ItemID']]

In [60]:
df1 = df1.explode('ItemID').reset_index(drop=True)
df1

   ItemID  fruits  price
0       4   apple     80
1       5   apple     80
2       6   apple     80
3       9  banana     50
4      10  banana     50
5      11  banana     50
6      14  carrot    110
7      15  carrot    110
8      16  carrot    110
9      17  carrot    110
10     18  carrot    110
11     19  carrot    110
12     20  carrot    110

In [62]:
data2 = {
    'EventID': [1, 2, 3],
    'Timestamps': [['2023-08-25 10:00', '2023-08-25 12:00'], ['2023-08-25 11:30'], ['2023-08-25 14:00']]
}

df2 = pd.DataFrame(data2)
exploded_df = df2.explode('Timestamps')
exploded_df

   EventID        Timestamps
0        1  2023-08-25 10:00
0        1  2023-08-25 12:00
1        2  2023-08-25 11:30
2        3  2023-08-25 14:00